sdaiValidateWhereRule(Sdai_instS*,Sdai_instS*)
\details
Determines whether the specified where rule is satisfied by the specified application instance.
\param instance [in] Identifier of the application instance to be validated.
\param rule     [in] Where rule to check.
\returns sdaiTRUE if where rule is satisfied by application instance; the function returns sdaiFALSE if rule is not satisfied,
or sdaiUNKNOWN if where rule can not be evaluated.